init nx repo
